/************************************
库功能：MSP430定时器A库
库要求：主函数中已定义：
        #include <msp430x14x.h>
        #include "atime_msp430core.h"
应用函数：
修改历史：
	‘修改人’   ‘修改内容’  ‘修改时间’
	  空	      空	  空
最后修改时间：2016-02-06
作者： ATIME	版权所有
实例程序：
常见错误解释：
***************************************/

#ifndef _ATIME_MSP430_TIMER_A_C_ 
#define _ATIME_MSP430_ATMER_A_C_


/************************************
库全局变量组
***************************************/


/************************************
函数功能：
传递参数：空
返回值：空
***************************************/


#endif