/************************************
库功能：软件SPI库
库要求：主函数中已定义：
        #include <msp430x14x.h>
        #include "atime_msp430core.h"
应用函数：
修改历史：
		   	 ‘修改人’   ‘修改内容’  ‘修改时间’
				空			空			空
最后修改时间：2016-01-31，尚未测试
作者： ATIME	版权所有
实例程序：
常见错误解释：
***************************************/


#ifndef _ATIME_MSP430_SPI_SOFTWARE_H_ 
#define _ATIME_MSP430_SPI_SOFTWARE_H_

#include "atime_spi_software.c"


 /**************************************
函数功能：端口初始化
传递参数：struct spi_s a：端口信息
返回值：空
***************************************/
void spi_s_init(struct spi_s a);


 /**************************************
函数功能：高低位互换
传递参数：待转换字节
返回值：结果
***************************************/
unsigned char transbit( unsigned char x);


/************************************
函数功能：SPI时钟跳变
传递参数：a:SPI信息
返回值：空
***************************************/
void spi_s_clk( struct spi_s a);


/************************************
函数功能：SPI读线上数据
传递参数：a:SPI信息
返回值：空
***************************************/
unsigned char spi_s_miso( struct spi_s a);


/************************************
函数功能：SPI写线上数据
传递参数：a:SPI信息
返回值：空
***************************************/
void spi_s_mosi( struct spi_s a, unsigned char data);


/************************************
函数功能：SPI写数据
传递参数：a:SPI信息；data：数据；
返回值：sdi读取的结果
***************************************/
unsigned char spi_s_write( struct spi_s a, unsigned char data);


/************************************
函数功能：SPI读数据
传递参数：a:SPI信息
返回值：读取的结果
***************************************/
unsigned char spi_s_read( struct spi_s a);



#endif