/************************************
库功能：MSP430内部ADC库
库要求：主函数中已定义：
        #include <msp430x14x.h>
        #include "atime_msp430core.h"
应用函数：
修改历史：
		   	 ‘修改人’   ‘修改内容’  ‘修改时间’
				空			空			空
最后修改时间：2014-01-29
作者： ATIME	版权所有
实例程序：
常见错误解释：
***************************************/


#ifndef _ATIME_MSP430_ADC_H_ 
#define _ATIME_MSP430_ADC_H_


/************************************
库全局变量组
***************************************/



/************************************
函数功能：
传递参数：空
返回值：
***************************************/


#endif