/************************************
库功能：软件IIC模块库
库要求：主函数中已定义：
        #include <msp430x14x.h>
        #include "atime_msp430core.h"
应用函数：
修改历史：
	‘修改人’   ‘修改内容’  ‘修改时间’
	  空          空	  空
最后修改时间：2016-02-05
作者： ATIME	版权所有
实例程序：
常见错误解释：
***************************************/


#ifndef _ATIME_MSP430_IIC_DS1307_H_ 
#define _ATIME_MSP430_IIC_DS1307_H_

/************************************
库全局变量组
***************************************/


/************************************
函数功能：IIC接口开始
传递参数：空
返回值：空
***************************************/