/************************************
库功能：AM2320库
库要求：主函数中已定义：
        #include <msp430x14x.h>
        #include "atime_msp430core.h"
        #include "atime_iic_software.h"
应用函数：
修改历史：
	‘修改人’   ‘修改内容’  ‘修改时间’
	  空          空	  空
最后修改时间：2016-02-05
作者： ATIME	版权所有
实例程序：

常见错误解释：
***************************************/

#ifndef _ATIME_MSP430_IIC_AM2320_C_ 
#define _ATIME_MSP430_IIC_AM2320_C_


/************************************
库全局变量组
***************************************/
unsigned char am2320_data[8]={0x00,0x50,0x20,0x05,0x05,0x02,0x16,0x00};


/************************************
函数功能：IIC接口读数据
传递参数：数据存储数组
返回值：空
***************************************/
void as2320_waken(unsigned char a[])
{
    iic_start_s();
    iic_writebyte_s(0xB8);
    wait_ms(1);
    iic_stop_s();
}

/************************************
函数功能：IIC接口读数据
传递参数：数据存储数组
返回值：空
***************************************/
void as2320_read(unsigned char a[])
{
    iic_start_s();
    iic_writebyte_s(0xB8);
    
}


/************************************
函数功能：IIC接口写数据
传递参数：数据存储数组
返回值：空
***************************************/
void am2320_write(unsigned char a[])
{

}


#endif